const faqData = [
    {
        "category": "個人資料類",
        "categoryId": "about-us",
        "items": [
            { "q": "請用英文自我介紹", "a": "Please introduce your self.\n必考項目" },
            { "q": "喺呢間學校讀咗兩年學到啲乜?", "a": "以普通話作答。" },
            { "q": "請問你喺校內同校外參加過啲咩活動? 有啲咩印象深刻?", "a": "以廣東話作答。" },
            { "q": "講一個喺青年學院你最印象深刻嘅活動或比賽。", "a": "以廣東話作答。" },
            { "q": "講一個喺青年學院讀書嘅感想。", "a": "以廣東話作答。" },
            { "q": "你曾經參加過創協盃比賽，你做隊長，可唔可以講下你負責啲咩，同埋學到啲咩？", "a": "以廣東話作答。" },
            { "q": "我見你話識日文喎，可唔可以講講？", "a": "以廣東話作答。主要講學習經歷，目標和學習原因，並非即場講日文。" }
        ]
    },
    {
        "category": "大灣區意見類",
        "categoryId": "GBA-info",
        "items": [
            { "q": "如果你成功攞到獎學金，去同大灣區嘅人交流，會同佢哋會講啲咩?", "a": "以廣東話作答。" },
            { "q": "深圳有啲咩公司？如果你同大陸嘅學生交流你會揀邊度，同埋交流啲乜？", "a": "廣東話作答。" }
        ]
    },
    {
        "category": "學校宣傳類",
        "categoryId": "School-info",
        "items": [
            { "q": "青年學院有邊三隻色？分別代表乜？", "a": "以廣東話作答。" },
            { "q": "請用20秒介紹人去讀青年學院？", "a": "普通話作答。" }
        ]
    }
];